app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('jaasuarezga', 'jaasuarezga@unal.edu.co', '$2a$10$7M1ep9yVJTWr51.kRAnTc./bV978Tg2MT18P2bFIqmZ5mInLpec86', '2018-04-30 04:34:51', '2018-04-30 04:34:51')
---
  def create
    @user = User.new(user_params)
    @user.password = params[:password]
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `username` = 'jairoa', `password_digest` = '$2a$10$CNNvG5Nxjq7d1/pJJZPcxe/odto86xO62tQEn4bFNAmuUciXUpANe', `updated_at` = '2018-05-01 16:53:29' WHERE `users`.`id` = 1
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    user = User.find(params[:id])
    if user.destroy